3.1 Creating a Dataframe

In [225]:
# Load library
import pandas as pd
# Create URL
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'
# Load data as a dataframe
dataframe = pd.read_csv(url)
# Show first five rows
dataframe.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [226]:
# Load library
import pandas as pd
# Create a dictionary
dictionary = {
"Name": ['Jacky Jackson', 'Steven Stevenson'],
"Age": [38, 25],
"Driver": [True, False]
}
# Create DataFrame
dataframe = pd.DataFrame(dictionary)
# Show DataFrame
dataframe

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [227]:
dataframe.head()

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [228]:
dataframe.head(10)

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [229]:
dataframe.tail()

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [230]:
dataframe.tail(10)

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [231]:
# Add a column for eye color
dataframe["Eyes"] = ["Brown", "Blue"]
# Show DataFrame
dataframe

               Name  Age  Driver   Eyes
0     Jacky Jackson   38    True  Brown
1  Steven Stevenson   25   False   Blue

3.2 Getting Information about the Data

In [232]:
# Show two rows
dataframe.head(2)

               Name  Age  Driver   Eyes
0     Jacky Jackson   38    True  Brown
1  Steven Stevenson   25   False   Blue

In [233]:
# Show dimensions
dataframe.shape
(1313, 6)

(1313, 6)

In [234]:
# Show statistics
dataframe.describe()

             Age
count   2.000000
mean   31.500000
std     9.192388
min    25.000000
25%    28.250000
50%    31.500000
75%    34.750000
max    38.000000

In [235]:
# Show info
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    2 non-null      object
 1   Age     2 non-null      int64
 2   Driver  2 non-null      bool
 3   Eyes    2 non-null      object
dtypes: bool(1), int64(1), object(2)
memory usage: 182.0+ bytes

3.3 Slicing DataFrames

In [236]:
# Select first row
dataframe.iloc[0]

Name      Jacky Jackson
Age                  38
Driver             True
Eyes              Brown
Name: 0, dtype: object

In [237]:
dataframe.iloc[0:4]

               Name  Age  Driver   Eyes
0     Jacky Jackson   38    True  Brown
1  Steven Stevenson   25   False   Blue

In [238]:
# Select three rows
dataframe.iloc[1:4]

               Name  Age  Driver  Eyes
1  Steven Stevenson   25   False  Blue

In [239]:
# Select four rows
dataframe.iloc[:4]

               Name  Age  Driver   Eyes
0     Jacky Jackson   38    True  Brown
1  Steven Stevenson   25   False   Blue

In [240]:
print(dataframe['Name'].unique())

['Jacky Jackson' 'Steven Stevenson']

In [241]:
# Set index
dataframe = dataframe.set_index(dataframe['Name'])
# Show row
dataframe.loc['Steven Stevenson']

Name      Steven Stevenson
Age                     25
Driver               False
Eyes                  Blue
Name: Steven Stevenson, dtype: object

In [242]:
dataframe.Age

Name
Jacky Jackson       38
Steven Stevenson    25
Name: Age, dtype: int64

3.4 Selecting Rows Based on Conditionals

In [243]:
print(dataframe.columns)

Index(['Name', 'Age', 'Driver', 'Eyes'], dtype='object')

In [244]:
# Show top two rows where column 'sex' is 'female'
dataframe[dataframe['Name'] == 'Steven Stevenson'].head(2)

                              Name  Age  Driver  Eyes
Name
Steven Stevenson  Steven Stevenson   25   False  Blue

In [245]:
# Filter rows
dataframe[(dataframe['Name'] == 'Steven Stevenson') & (dataframe['Age'] >= 65)]

Empty DataFrame
Columns: [Name, Age, Driver, Eyes]
Index: []

3.5 Sorting Values

In [246]:
# Sort the dataframe by age, show two rows
dataframe.sort_values(by=["Age"]).head(10)

                              Name  Age  Driver   Eyes
Name
Steven Stevenson  Steven Stevenson   25   False   Blue
Jacky Jackson        Jacky Jackson   38    True  Brown

In [247]:
dataframe.sort_values(by=["Age"], ascending = False).head(10)

                              Name  Age  Driver   Eyes
Name
Jacky Jackson        Jacky Jackson   38    True  Brown
Steven Stevenson  Steven Stevenson   25   False   Blue

3.6 Replacing Values

In [248]:
dataframe.head()

                              Name  Age  Driver   Eyes
Name
Jacky Jackson        Jacky Jackson   38    True  Brown
Steven Stevenson  Steven Stevenson   25   False   Blue

In [249]:
dataframe.replace(1, "One").head(2)

                              Name  Age  Driver   Eyes
Name
Jacky Jackson        Jacky Jackson   38    True  Brown
Steven Stevenson  Steven Stevenson   25   False   Blue

In [250]:
# Replace values, show two rows
dataframe.replace(1, "One").head(2)

                              Name  Age  Driver   Eyes
Name
Jacky Jackson        Jacky Jackson   38    True  Brown
Steven Stevenson  Steven Stevenson   25   False   Blue

In [251]:
# Replace values, show two rows
dataframe.replace(r"1st", "First", regex=True).head(2)

                              Name  Age  Driver   Eyes
Name
Jacky Jackson        Jacky Jackson   38    True  Brown
Steven Stevenson  Steven Stevenson   25   False   Blue

3.7 Renaming Columns

In [252]:
# Rename column, show two rows
dataframe.rename(columns={'PClass': 'Passenger Class'}).head(2)

                              Name  Age  Driver   Eyes
Name
Jacky Jackson        Jacky Jackson   38    True  Brown
Steven Stevenson  Steven Stevenson   25   False   Blue

In [253]:
# Rename columns, show two rows
dataframe.rename(columns={'PClass': 'Passenger Class', 'Sex': 'Gender'}).head(2)

                              Name  Age  Driver   Eyes
Name
Jacky Jackson        Jacky Jackson   38    True  Brown
Steven Stevenson  Steven Stevenson   25   False   Blue

3.8 Finding the Minimum, Maximum, Sum, Average, and Count

In [254]:
# Calculate statistics
print('Maximum:', dataframe['Age'].max())
print('Minimum:', dataframe['Age'].min())
print('Mean:', dataframe['Age'].mean())
print('Sum:', dataframe['Age'].sum())
print('Count:', dataframe['Age'].count())

Maximum: 38
Minimum: 25
Mean: 31.5
Sum: 63
Count: 2

3.9 Finding Unique Values

In [255]:
# Select unique values
dataframe['Age'].unique()

array([38, 25])

In [256]:
dataframe['Age'].unique()

array([38, 25])

In [257]:
# Show counts
dataframe['Age'].value_counts()

Age
38    1
25    1
Name: count, dtype: int64

3.10 Handling Missing Values

In [258]:
# Select missing values, show two rows
dataframe[dataframe['Age'].isnull()].head(2)

Empty DataFrame
Columns: [Name, Age, Driver, Eyes]
Index: []

In [259]:
# Load library
import numpy as np
# Replace values with NaN
#dataframe['Sex'] = dataframe['Sex'].replace('male', np.nan)

In [260]:
dataframe

                              Name  Age  Driver   Eyes
Name
Jacky Jackson        Jacky Jackson   38    True  Brown
Steven Stevenson  Steven Stevenson   25   False   Blue

In [261]:
# Load data, set missing values
dataframe = pd.read_csv(url, na_values=[np.nan, 'NONE', -999])

In [262]:
# Get a single null row
null_entry = dataframe[dataframe["Age"].isna()].head(1)
print(null_entry)

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1

In [263]:
# Fill all null values with the mean age of passengers
null_entry.fillna(dataframe["Age"].mean())

                            Name PClass        Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  30.397989  female         1        1

In [264]:
dataframe

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,male,0,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,male,0,0
1310,"Zenni, Mr Philip",3rd,22.00,male,0,0
1311,"Lievens, Mr Rene",3rd,24.00,male,0,0
1312,"Zimmerman, Leo",3rd,29.00,male,0,0

3.11 Deleting a Column

In [265]:
# Load library
import pandas as pd
# Create URL
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'
# Load data
dataframe = pd.read_csv(url)
# Delete column
dataframe.drop('Age', axis=1).head(2)

                           Name PClass     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  female         1        1
1   Allison, Miss Helen Loraine    1st  female         0        1

In [266]:
# Drop columns
dataframe.drop(['Age', 'Sex'], axis=1).head(2)

                           Name PClass  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st         1        1
1   Allison, Miss Helen Loraine    1st         0        1

In [267]:
# Drop column
dataframe.drop(dataframe.columns[1], axis=1).head(2)

                           Name   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton  29.0  female         1        1
1   Allison, Miss Helen Loraine   2.0  female         0        1

In [268]:
dataframe.drop(dataframe.columns[[1, 2]], axis=1, inplace=True)

In [269]:
# Create a new DataFrame
dataframe_name_dropped = dataframe.drop(dataframe.columns[0], axis=1)

3.12 Deleting a Row

In [270]:
# Delete rows, show first three rows of output
dataframe[dataframe['Sex'] != 'male'].head(3)

                                            Name     Sex  Survived  SexCode
0                   Allen, Miss Elisabeth Walton  female         1        1
1                    Allison, Miss Helen Loraine  female         0        1
3  Allison, Mrs Hudson JC (Bessie Waldo Daniels)  female         0        1

In [271]:
# Delete row, show first two rows of output
dataframe[dataframe['Name'] != 'Allison, Miss Helen Loraine'].head(2)

                                  Name     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton  female         1        1
2  Allison, Mr Hudson Joshua Creighton    male         0        0

In [272]:
# Delete row, show first two rows of output
dataframe[dataframe.index != 0].head(2)

                                  Name     Sex  Survived  SexCode
1          Allison, Miss Helen Loraine  female         0        1
2  Allison, Mr Hudson Joshua Creighton    male         0        0

3.13 Dropping Duplicate Rows

In [273]:
# Drop duplicates, show first two rows of output
dataframe.drop_duplicates().head(2)

                           Name     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton  female         1        1
1   Allison, Miss Helen Loraine  female         0        1

In [274]:
# Drop duplicates
dataframe.drop_duplicates(subset=['Sex'])

                                  Name     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton  female         1        1
2  Allison, Mr Hudson Joshua Creighton    male         0        0